Revit 2027 API
RebarConstraintsManager.ClearHandleConstraintPairHighlighting Method
 Clears all highlighting in all views.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ClearHandleConstraintPairHighlighting(
	Document document
)
Public Sub ClearHandleConstraintPairHighlighting (
	document As Document
)
public:
void ClearHandleConstraintPairHighlighting(
	Document^ document
)
member ClearHandleConstraintPairHighlighting :
        document : Document -> unit
Parameters
document Document
 The document in which the highlighting will be cleared.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 If highlightHandleConstraintPairInAllViews has been called, then this method can be used to remove all highlighting.
See Also
Reference
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace